In [1]:
pip install pandas

Requirement already satisfied: pandas in d:\py\lib\site-packages (1.0.4)Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: pytz>=2017.2 in d:\py\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: numpy>=1.13.3 in d:\py\lib\site-packages (from pandas) (1.18.1)
Requirement already satisfied: python-dateutil>=2.6.1 in d:\py\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in d:\py\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)

You are using pip version 19.0.3, however version 20.2b1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

In [2]:
import pandas as pd

# series

series as single Dim and coloumn only and data frame is multi dim with rows and coloumn

In [3]:
a=[1,2,3,4,5]

In [4]:
a

[1, 2, 3, 4, 5]

In [5]:
pd.Series(data=a)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
labels=['a','b','c','d','e']
pd.Series(data=a,index=labels)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
import numpy as np

In [8]:
ab=np.ones(5)

In [9]:

ab

array([1., 1., 1., 1., 1.])

In [10]:

pd.Series(ab)

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
dtype: float64

In [11]:

pd.Series(ab,labels)

a    1.0
b    1.0
c    1.0
d    1.0
e    1.0
dtype: float64

In [12]:
z={'a':1,'b':2,'c':3,'d':4,'e':5}

In [13]:
z

{'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}

In [14]:
pd.Series(z)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [15]:
ser1=pd.Series([1,2,3,4],index=['usa','ind','aus','new'])

In [16]:
ser1

usa    1
ind    2
aus    3
new    4
dtype: int64

In [17]:
ser1['new']

4

In [18]:
ser2=pd.Series([1,2,6,4],index=['usa','ind','afr','new'])

In [19]:
ser1

usa    1
ind    2
aus    3
new    4
dtype: int64

In [20]:
ser2

usa    1
ind    2
afr    6
new    4
dtype: int64

In [21]:
ser1+ser2

afr    NaN
aus    NaN
ind    4.0
new    8.0
usa    2.0
dtype: float64

In [22]:
mylist=[10,20,30,40]
mylist

[10, 20, 30, 40]

In [23]:
pd.Series

pandas.core.series.Series

In [24]:
pd.Series(mylist)

0    10
1    20
2    30
3    40
dtype: int64

In [25]:
labels=['a','b','c','d']
pd.Series(data=mylist,index=labels)

a    10
b    20
c    30
d    40
dtype: int64

In [26]:
pd.Series(mylist,labels)

a    10
b    20
c    30
d    40
dtype: int64

In [27]:
a=np.ones(1)

In [28]:
a

array([1.])

# DataFrame

In [29]:
emp=pd.DataFrame({'Empcode':['Emp001','Emp002','Emp003'],'Name':['sagar','yadav','tinu'],'Occupation':['ML','AI','DS'],
                 'Date of Joining':['2019-3-4','2033-3-5','2020-5-6'],'Age':[30,40,50]})

In [30]:
type(emp)

pandas.core.frame.DataFrame

In [31]:
emp

  Empcode   Name Occupation Date of Joining  Age
0  Emp001  sagar         ML        2019-3-4   30
1  Emp002  yadav         AI        2033-3-5   40
2  Emp003   tinu         DS        2020-5-6   50

In [32]:
emp.columns

Index(['Empcode', 'Name', 'Occupation', 'Date of Joining', 'Age'], dtype='object')

In [33]:
emp.columns=['Empcode','Empname','Empoccupation','EmpDOJ','EmpAge']

In [34]:
emp

  Empcode Empname Empoccupation    EmpDOJ  EmpAge
0  Emp001   sagar            ML  2019-3-4      30
1  Emp002   yadav            AI  2033-3-5      40
2  Emp003    tinu            DS  2020-5-6      50

In [35]:
#drop a column

In [36]:
emp.drop('EmpAge',axis=1)

  Empcode Empname Empoccupation    EmpDOJ
0  Emp001   sagar            ML  2019-3-4
1  Emp002   yadav            AI  2033-3-5
2  Emp003    tinu            DS  2020-5-6

In [37]:
emp

  Empcode Empname Empoccupation    EmpDOJ  EmpAge
0  Emp001   sagar            ML  2019-3-4      30
1  Emp002   yadav            AI  2033-3-5      40
2  Emp003    tinu            DS  2020-5-6      50

In [38]:
emp.drop('EmpAge',axis=1,inplace=True)

In [39]:
emp

  Empcode Empname Empoccupation    EmpDOJ
0  Emp001   sagar            ML  2019-3-4
1  Emp002   yadav            AI  2033-3-5
2  Emp003    tinu            DS  2020-5-6

In [40]:
empl=pd.DataFrame({'Empcode':['Emp001','Emp002','Emp003'],'Name':['sagar','yadav','tinu'],'Occupation':['ML','AI','DS'],
                 'Date of Joining':['2019-3-4','2033-3-5','2020-5-6'],'Age':[30,40,50]})

In [41]:
empl

  Empcode   Name Occupation Date of Joining  Age
0  Emp001  sagar         ML        2019-3-4   30
1  Emp002  yadav         AI        2033-3-5   40
2  Emp003   tinu         DS        2020-5-6   50

In [42]:
empl.drop(empl.columns[[0,4]],axis=1,inplace=True)

In [43]:
empl

    Name Occupation Date of Joining
0  sagar         ML        2019-3-4
1  yadav         AI        2033-3-5
2   tinu         DS        2020-5-6

In [44]:
empl['city']=['hyd','del','mum']

In [45]:
empl

    Name Occupation Date of Joining city
0  sagar         ML        2019-3-4  hyd
1  yadav         AI        2033-3-5  del
2   tinu         DS        2020-5-6  mum

# select multiple  column in dataframe

In [46]:
empl=pd.DataFrame({'Empcode':['Emp001','Emp002','Emp003'],'Name':['sagar','yadav','tinu'],'Occupation':['ML','AI','DS'],
                 'Date of Joining':['2019-3-4','2033-3-5','2020-5-6'],'Age':[30,40,50]})

In [48]:
empl

  Empcode   Name Occupation Date of Joining  Age
0  Emp001  sagar         ML        2019-3-4   30
1  Emp002  yadav         AI        2033-3-5   40
2  Emp003   tinu         DS        2020-5-6   50

In [49]:
df=empl[['Occupation','Date of Joining','Age']]
df

  Occupation Date of Joining  Age
0         ML        2019-3-4   30
1         AI        2033-3-5   40
2         DS        2020-5-6   50

In [53]:
empl=pd.DataFrame({'Empcode':['Emp001','Emp002','Emp003'],'Name':['sagar','yadav','tinu'],'Occupation':['ML','AI','DS'],
                 'Date of Joining':['2019-3-4','2033-3-5','2020-5-6'],'Age':[30,40,50]})

empl2=pd.DataFrame({'Empcode':['Emp001','Emp002','Emp003'],'Name':['sagar','yadav','tinu'],'Occupation':['ML','AI','DS'],
                 'Date of Joining':['2019-3-4','2033-3-5','2020-5-6'],'Age':[30,40,50],'color':['Red','green','blue']})

In [54]:
e=empl.append(empl2)

In [55]:
e

  Empcode   Name Occupation Date of Joining  Age  color
0  Emp001  sagar         ML        2019-3-4   30    NaN
1  Emp002  yadav         AI        2033-3-5   40    NaN
2  Emp003   tinu         DS        2020-5-6   50    NaN
0  Emp001  sagar         ML        2019-3-4   30    Red
1  Emp002  yadav         AI        2033-3-5   40  green
2  Emp003   tinu         DS        2020-5-6   50   blue

In [56]:
e=empl.append(empl2,sort=True)

In [57]:
e

   Age Date of Joining Empcode   Name Occupation  color
0   30        2019-3-4  Emp001  sagar         ML    NaN
1   40        2033-3-5  Emp002  yadav         AI    NaN
2   50        2020-5-6  Emp003   tinu         DS    NaN
0   30        2019-3-4  Emp001  sagar         ML    Red
1   40        2033-3-5  Emp002  yadav         AI  green
2   50        2020-5-6  Emp003   tinu         DS   blue

In [60]:
e=empl.append(empl2,sort=True,ignore_index=True)

In [61]:
e

   Age Date of Joining Empcode   Name Occupation  color
0   30        2019-3-4  Emp001  sagar         ML    NaN
1   40        2033-3-5  Emp002  yadav         AI    NaN
2   50        2020-5-6  Emp003   tinu         DS    NaN
3   30        2019-3-4  Emp001  sagar         ML    Red
4   40        2033-3-5  Emp002  yadav         AI  green
5   50        2020-5-6  Emp003   tinu         DS   blue

In [64]:
e.isnull().any()  #missing value for whole data frame

Age                False
Date of Joining    False
Empcode            False
Name               False
Occupation         False
color               True
dtype: bool

In [66]:
e['color'].isnull().any()  #missing value for particualr column data frame

True

In [67]:
e['color'].isnull()

0     True
1     True
2     True
3    False
4    False
5    False
Name: color, dtype: bool

In [68]:
e['color'].mode()

0      Red
1     blue
2    green
dtype: object

In [69]:
e['color'].value_counts()

green    1
Red      1
blue     1
Name: color, dtype: int64

In [71]:
data={'company':['GOOG','GOOG','MHFT','MHFT','FB','FB'],
      'person':['Sam','charlie','Amie','vanessa','carl','sarah'],
      'Sales':[200,120,340,124,243,350]}

In [72]:
data

{'company': ['GOOG', 'GOOG', 'MHFT', 'MHFT', 'FB', 'FB'],
 'person': ['Sam', 'charlie', 'Amie', 'vanessa', 'carl', 'sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [73]:
df=pd.DataFrame(data)
df

  company   person  Sales
0    GOOG      Sam    200
1    GOOG  charlie    120
2    MHFT     Amie    340
3    MHFT  vanessa    124
4      FB     carl    243
5      FB    sarah    350

In [79]:
 x=df.groupby('company') # group and then mean

In [80]:
x

In [81]:
x.mean()

         Sales
company
FB       296.5
GOOG     160.0
MHFT     232.0

In [83]:
x.std() #Standard Deviation of company std()

              Sales
company
FB        75.660426
GOOG      56.568542
MHFT     152.735065

In [85]:
x.min()  #minimum Sales

        person  Sales
company
FB        carl    243
GOOG       Sam    120
MHFT      Amie    124

In [87]:
x.max()   #maximum Sales

          person  Sales
company
FB         sarah    350
GOOG     charlie    200
MHFT     vanessa    340

In [89]:
x.count()  #count of it total

         person  Sales
company
FB            2      2
GOOG          2      2
MHFT          2      2

In [90]:
x.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MHFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0